% 信息隐藏技术第一次作业 -- 基于DCT的图像压缩
% 作者：胡京徽
% 学号：11061191
% 日期：2013/10/21
% 
% 读取同级目录下的文件名为 原图.jpg 图片, 然后进行处理

clear, clear all;                   % 先清空一遍
I = imread('原图.jpg');             % 读图
subplot(3,2,1),imshow(I),title('原图');
I = rgb2gray(I);                    % 获取灰度图
subplot(3,2,2),imshow(I),title('灰度图');
%imwrite(I,'灰度图.tif');
I = im2double(I);                   % 转为double型矩阵
T = dctmtx(8);                      % 获取DCT转换矩阵
dct = @(x)T * x * T';               % DCT 正变换
invdct = @(x)T' * x * T;            % DCT 逆变换
mask = [ 1 1 1 1 0 0 0 0            % 8 乘 8 掩码矩阵
         1 1 1 0 0 0 0 0
         1 1 0 0 0 0 0 0
         1 0 0 0 0 0 0 0
         0 0 0 0 0 0 0 0
         0 0 0 0 0 0 0 0
         0 0 0 0 0 0 0 0
         0 0 0 0 0 0 0 0 ];
B = blkproc(I, [8 8], dct);         % 分成 8 乘 8 块
B8 = blkproc(B, [8 8], @(x)mask.* x); % 掩码处理
subplot(3,2,3), imshow(B8),title('8乘8分块压缩图');
%imwrite(B8,'8乘8分块压缩图.tif');
I8 = blkproc(B8, [8 8], invdct);    % 逆变换
subplot(3,2,4), imshow(I8),title('8乘8分块复原图');
%imwrite(I8,'8乘8分块复原图.tif');
% 由于图片较大，类似的进行了16乘16分块处理
mask16 = [ 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0
           1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0
           1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
           0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0];
T16 = dctmtx(16);
dct16 = @(x)T16 * x * T16';
invdct16 = @(x)T16' * x * T16;
B = blkproc(I, [16 16], dct16);
B16 = blkproc(B, [16 16], @(x)mask16.* x);
subplot(3,2,5), imshow(B16),title('16乘16分块压缩图');
%imwrite(B16,'16乘16分块压缩图.tif');
I16 = blkproc(B16, [16 16], invdct16);
subplot(3,2,6), imshow(I16),title('16乘16分块复原图');
%imwrite(I16,'16乘16分块复原图.tif');
